RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_xmc.h
/**
 **************************************************************************
 * File Name    : at32f4xx_xmc.h
 * Description  : at32f4xx XMC header file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_XMC_H
#define __AT32F4xx_XMC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup XMC
  * @{
  */

/** @defgroup XMC_Exported_Types
  * @{
  */

/**
  * @brief  Timing parameters For NOR/SRAM Banks
  */

typedef struct
{
    uint32_t XMC_AdrOpTime;                 /*!< Defines the number of HCLK cycles to configure
                                                       the duration of the address setup time.
                                                       This parameter can be a value between 0 and 0xF.
                                                       @note: It is not used with synchronous NOR Flash memories. */

    uint32_t XMC_AdrHoldTime;               /*!< Defines the number of HCLK cycles to configure
                                                    the duration of the address hold time.
                                                    This parameter can be a value between 0 and 0xF.
                                                    @note: It is not used with synchronous NOR Flash memories.*/

    uint32_t XMC_DataOpTime;                /*!< Defines the number of HCLK cycles to configure
                                                   the duration of the data setup time.
                                                   This parameter can be a value between 0 and 0xFF.
                                                   @note: It is used for SRAMs, ROMs and asynchronous multiplexed NOR Flash memories. */

    uint32_t XMC_IntervalBetweenOP;         /*!< Defines the number of HCLK cycles to configure
                                                    the duration of the bus turnaround.
                                                    This parameter can be a value between 0 and 0xF.
                                                    @note: It is only used for multiplexed NOR Flash memories. */

    uint32_t XMC_CLKPsc;                    /*!< Defines the period of CLK clock output signal, expressed in number of HCLK cycles.
                                                     This parameter can be a value between 1 and 0xF.
                                                     @note: This parameter is not used for asynchronous NOR Flash, SRAM or ROM accesses. */

    uint32_t XMC_DataStableTime;            /*!< Defines the number of memory clock cycles to issue
                                             to the memory before getting the first data.
                                             The value of this parameter depends on the memory type as shown below:
                                              - It must be set to 0 in case of a CRAM
                                              - It is don't care in asynchronous NOR, SRAM or ROM accesses
                                              - It may assume a value between 0 and 0xF in NOR Flash memories
                                                with synchronous burst mode enable */

    uint32_t XMC_Mode;                      /*!< Specifies the asynchronous access mode.
                                                      This parameter can be a value of @ref XMC_Access_Mode */
} XMC_NORSRAMTimingInitType;

/**
  * @brief  XMC NOR/SRAM Init structure definition
  */

typedef struct
{
    uint32_t XMC_Bank;                      /*!< Specifies the NOR/SRAM memory bank that will be used.
                                                 This parameter can be a value of @ref XMC_NORSRAM_Bank */

    uint32_t XMC_DataAdrMux;                /*!< Specifies whether the address and data values are
                                                 multiplexed on the databus or not.
                                                 This parameter can be a value of @ref XMC_Data_Address_Bus_Multiplexing */

    uint32_t XMC_Dev;                       /*!< Specifies the type of external memory attached to
                                                 the corresponding memory bank.
                                                 This parameter can be a value of @ref XMC_Memory_Type */

    uint32_t XMC_BusType;                   /*!< Specifies the external memory device width.
                                                        This parameter can be a value of @ref XMC_Data_Width */

    uint32_t XMC_EnableBurstMode;           /*!< Enables or disables the burst access mode for Flash memory,
                                                 valid only with synchronous burst Flash memories.
                                                 This parameter can be a value of @ref XMC_Burst_Access_Mode */

    uint32_t XMC_EnableAsynWait;            /*!< Enables or disables wait signal during asynchronous transfers,
                                                 valid only with asynchronous Flash memories.
                                                 This parameter can be a value of @ref XMC_EnableAsynWait */

    uint32_t XMC_WaitSignalLv;              /*!< Specifies the wait signal polarity, valid only when accessing
                                                 the Flash memory in burst mode.
                                                 This parameter can be a value of @ref XMC_Wait_Signal_Polarity */

    uint32_t XMC_EnableBurstModeSplit;      /*!< Enables or disables the Wrapped burst access mode for Flash
                                                 memory, valid only when accessing Flash memories in burst mode.
                                                 This parameter can be a value of @ref XMC_Wrap_Mode */

    uint32_t XMC_WaitSignalConfig;          /*!< Specifies if the wait signal is asserted by the memory one
                                                 clock cycle before the wait state or during the wait state,
                                                 valid only when accessing memories in burst mode.
                                                 This parameter can be a value of @ref XMC_Wait_Timing */

