RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_xmc.h
    uint32_t XMC_EnableWrite;               /*!< Enables or disables the write operation in the selected bank by the XMC.
                                                 This parameter can be a value of @ref XMC_Write_Operation */

    uint32_t XMC_EnableWaitSignal;          /*!< Enables or disables the wait-state insertion via wait
                                                 signal, valid for Flash memory access in burst mode.
                                                 This parameter can be a value of @ref XMC_Wait_Signal */

    uint32_t XMC_EnableWriteTiming;         /*!< Enables or disables the extended mode.
                                                 This parameter can be a value of @ref XMC_Extended_Mode */

    uint32_t XMC_WriteBurstSyn;             /*!< Enables or disables the write burst operation.
                                                 This parameter can be a value of @ref XMC_Write_Burst */

    XMC_NORSRAMTimingInitType* XMC_RWTimingStruct;  /*!< Timing Parameters for write and read access if the  ExtendedMode is not used*/

    XMC_NORSRAMTimingInitType* XMC_WTimingStruct;   /*!< Timing Parameters for write access if the  ExtendedMode is used*/
} XMC_NORSRAMInitType;

/**
  * @brief  Timing parameters For XMC NAND and PCCARD Banks
  */

typedef struct
{
    uint32_t XMC_SetupTime;                 /*!< Defines the number of HCLK cycles to setup address before
                                                 the command assertion for NAND-Flash read or write access
                                                 to common/Attribute or I/O memory space (depending on
                                                 the memory space timing to be configured).
                                                 This parameter can be a value between 0 and 0xFF.*/

    uint32_t XMC_OpTime;                    /*!< Defines the minimum number of HCLK cycles to assert the
                                                 command for NAND-Flash read or write access to
                                                 common/Attribute or I/O memory space (depending on the
                                                 memory space timing to be configured).
                                                 This parameter can be a number between 0x00 and 0xFF */

    uint32_t XMC_HoldTime;                  /*!< Defines the number of HCLK clock cycles to hold address
                                                 (and data for write access) after the command deassertion
                                                 for NAND-Flash read or write access to common/Attribute
                                                 or I/O memory space (depending on the memory space timing
                                                 to be configured).
                                                 This parameter can be a number between 0x00 and 0xFF */

    uint32_t XMC_WriteSetupTime;            /*!< Defines the number of HCLK clock cycles during which the
                                                 databus is kept in HiZ after the start of a NAND-Flash
                                                 write access to common/Attribute or I/O memory space (depending
                                                 on the memory space timing to be configured).
                                                 This parameter can be a number between 0x00 and 0xFF */
} XMC_NAND_PCCARDTimingInitType;

/**
  * @brief  XMC NAND Init structure definition
  */

typedef struct
{
    uint32_t XMC_Bank;                      /*!< Specifies the NAND memory bank that will be used.
                                                 This parameter can be a value of @ref XMC_NAND_Bank */

    uint32_t XMC_EnableWait;                /*!< Enables or disables the Wait feature for the NAND Memory Bank.
                                                 This parameter can be any value of @ref XMC_Wait_feature */

    uint32_t XMC_BusType;                   /*!< Specifies the external memory device width.
                                                 This parameter can be any value of @ref XMC_Data_Width */

    uint32_t XMC_EnableECC;                 /*!< Enables or disables the ECC computation.
                                                 This parameter can be any value of @ref XMC_EnableECC */

    uint32_t XMC_ECCPageSize;               /*!< Defines the page size for the extended ECC.
                                                 This parameter can be any value of @ref XMC_ECC_Page_Size */

    uint32_t XMC_DelayTimeCR;               /*!< Defines the number of HCLK cycles to configure the
                                                 delay between CLE low and RE low.
                                                 This parameter can be a value between 0 and 0xFF. */

    uint32_t XMC_DelayTimeAR;               /*!< Defines the number of HCLK cycles to configure the
                                                 delay between ALE low and RE low.
                                                 This parameter can be a number between 0x0 and 0xFF */

    XMC_NAND_PCCARDTimingInitType*  XMC_CommonSpaceTimingStruct;    /*!< XMC Common Space Timing */

    XMC_NAND_PCCARDTimingInitType*  XMC_AttributeSpaceTimingStruct; /*!< XMC Attribute Space Timing */
} XMC_NANDInitType;

/**
  * @brief  XMC PCCARD Init structure definition
  */

typedef struct
{
    uint32_t XMC_EnableWait;                /*!< Enables or disables the Wait feature for the Memory Bank.
                                                 This parameter can be any value of @ref XMC_Wait_feature */

    uint32_t XMC_DelayTimeCR;               /*!< Defines the number of HCLK cycles to configure the
                                                 delay between CLE low and RE low.
                                                 This parameter can be a value between 0 and 0xFF. */

    uint32_t XMC_DelayTimeAR;               /*!< Defines the number of HCLK cycles to configure the
                                                 delay between ALE low and RE low.
                                                 This parameter can be a number between 0x0 and 0xFF */


    XMC_NAND_PCCARDTimingInitType*  XMC_CommonSpaceTimingStruct; /*!< XMC Common Space Timing */

