RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_xmc.h
    XMC_NAND_PCCARDTimingInitType*  XMC_AttributeSpaceTimingStruct;  /*!< XMC Attribute Space Timing */

    XMC_NAND_PCCARDTimingInitType*  XMC_IOSpaceTimingStruct; /*!< XMC IO Space Timing */
} XMC_PCCARDInitType;

/**
  * @}
  */

/** @defgroup XMC_Exported_Constants
  * @{
  */

/** @defgroup XMC_NORSRAM_Bank
  * @{
  */
#define XMC_Bank1_NORSRAM1                  ((uint32_t)0x00000000)
#define XMC_Bank1_NORSRAM2                  ((uint32_t)0x00000002)
#define XMC_Bank1_NORSRAM3                  ((uint32_t)0x00000004)
#define XMC_Bank1_NORSRAM4                  ((uint32_t)0x00000006)
/**
  * @}
  */

/** @defgroup XMC_SubBank
  * @{
  */
#define XMC_SubBank1_NORSRAM1                  ((uint32_t)0x00000000)
#define XMC_SubBank1_NORSRAM2                  ((uint32_t)0x00000001)
#define XMC_SubBank1_NORSRAM3                  ((uint32_t)0x00000002)
#define XMC_SubBank1_NORSRAM4                  ((uint32_t)0x00000003)
/**
  * @}
  */


/** @defgroup XMC_NAND_Bank
  * @{
  */
#define XMC_Bank2_NAND                      ((uint32_t)0x00000010)
#define XMC_Bank3_NAND                      ((uint32_t)0x00000100)
/**
  * @}
  */

/** @defgroup XMC_PCCARD_Bank
  * @{
  */
#define XMC_Bank4_PCCARD                    ((uint32_t)0x00001000)
/**
  * @}
  */

#define IS_XMC_Sub_NORSRAM_REGION(REGION)       (((REGION) == XMC_SubBank1_NORSRAM1) || \
                                             ((REGION) == XMC_SubBank1_NORSRAM2) || \
                                             ((REGION) == XMC_SubBank1_NORSRAM3) || \
                                             ((REGION) == XMC_SubBank1_NORSRAM4))

#define IS_XMC_NORSRAM_REGION(REGION)       (((REGION) == XMC_Bank1_NORSRAM1) || \
                                             ((REGION) == XMC_Bank1_NORSRAM2) || \
                                             ((REGION) == XMC_Bank1_NORSRAM3) || \
                                             ((REGION) == XMC_Bank1_NORSRAM4))

#define IS_XMC_NAND_BANK(BANK)              (((BANK) == XMC_Bank2_NAND) || \
                                             ((BANK) == XMC_Bank3_NAND))

#define IS_XMC_GETFLAG_BANK(BANK)           (((BANK) == XMC_Bank2_NAND) || \
                                             ((BANK) == XMC_Bank3_NAND) || \
                                             ((BANK) == XMC_Bank4_PCCARD))

#define IS_XMC_INT_BANK(BANK)               (((BANK) == XMC_Bank2_NAND) || \
                                             ((BANK) == XMC_Bank3_NAND) || \
                                             ((BANK) == XMC_Bank4_PCCARD))

/** @defgroup NOR_SRAM_Controller
  * @{
  */

/** @defgroup XMC_Data_Address_Bus_Multiplexing
  * @{
  */

#define XMC_DataAdrMux_Disable              ((uint32_t)0x00000000)
#define XMC_DataAdrMux_Enable               ((uint32_t)0x00000002)
#define IS_XMC_MUX(MUX)                     (((MUX) == XMC_DataAdrMux_Disable) || \
                                             ((MUX) == XMC_DataAdrMux_Enable))

/**
  * @}
  */

/** @defgroup XMC_Memory_Type
  * @{
  */

#define XMC_Dev_SRAM                        ((uint32_t)0x00000000)
#define XMC_Dev_PSRAM                       ((uint32_t)0x00000004)
#define XMC_Dev_NOR                         ((uint32_t)0x00000008)
#define IS_XMC_DEVICE(DEVICE)               (((DEVICE) == XMC_Dev_SRAM) || \
                                             ((DEVICE) == XMC_Dev_PSRAM)|| \
                                             ((DEVICE) == XMC_Dev_NOR))

/**
  * @}
  */

/** @defgroup XMC_Data_Width
  * @{
  */

#define XMC_BusType_8b                      ((uint32_t)0x00000000)
#define XMC_BusType_16b                     ((uint32_t)0x00000010)
#define IS_XMC_BUS_TYPE(TYPE)               (((TYPE) == XMC_BusType_8b) || \
                                             ((TYPE) == XMC_BusType_16b))

/**
  * @}
  */

/** @defgroup XMC_Burst_Access_Mode
  * @{
  */

#define XMC_BurstMode_Disable               ((uint32_t)0x00000000)
#define XMC_BurstMode_Enable                ((uint32_t)0x00000100)
#define IS_XMC_BURSTMODE(STATE)             (((STATE) == XMC_BurstMode_Disable) || \
                                             ((STATE) == XMC_BurstMode_Enable))
/**
  * @}
  */

/** @defgroup XMC_AsynchronousWait
  * @{
  */
#define XMC_AsynWait_Disable                ((uint32_t)0x00000000)
#define XMC_AsynWait_Enable                 ((uint32_t)0x00008000)
#define IS_XMC_ASYNWAIT(STATE)              (((STATE) == XMC_AsynWait_Disable) || \
                                             ((STATE) == XMC_AsynWait_Enable))

/**
  * @}
  */

/** @defgroup XMC_Wait_Signal_Polarity
  * @{
  */

#define XMC_WaitSignalLv_Low                ((uint32_t)0x00000000)
#define XMC_WaitSignalLv_High               ((uint32_t)0x00000200)
#define IS_XMC_WAIT_SIGNAL_LEVEL(LEVEL)     (((LEVEL) == XMC_WaitSignalLv_Low) || \
                                             ((LEVEL) == XMC_WaitSignalLv_High))

/**
  * @}
  */

/** @defgroup XMC_Wrap_Mode
  * @{
  */

#define XMC_BurstModeSplit_Disable          ((uint32_t)0x00000000)
#define XMC_BurstModeSplit_Enable           ((uint32_t)0x00000400)
#define IS_XMC_BURSTMODE_SPLIT(MODE)        (((MODE) == XMC_BurstModeSplit_Disable) || \
                                             ((MODE) == XMC_BurstModeSplit_Enable))

/**
  * @}
  */

/** @defgroup XMC_Wait_Timing
  * @{
  */

#define XMC_WaitSignalConfig_BeforeWaitState        ((uint32_t)0x00000000)
#define XMC_WaitSignalConfig_DuringWaitState        ((uint32_t)0x00000800)
#define IS_XMC_WAIT_SIGNAL_CONFIG(CONFIG)           (((CONFIG) == XMC_WaitSignalConfig_BeforeWaitState) || \
                                                     ((CONFIG) == XMC_WaitSignalConfig_DuringWaitState))

/**
  * @}
  */

/** @defgroup XMC_Write_Operation
  * @{
  */

#define XMC_WriteOperation_Disable          ((uint32_t)0x00000000)
#define XMC_WriteOperation_Enable           ((uint32_t)0x00001000)
#define IS_XMC_WRITE_OPERATION(OPERATION)   (((OPERATION) == XMC_WriteOperation_Disable) || \
                                             ((OPERATION) == XMC_WriteOperation_Enable))

/**
  * @}
  */

/** @defgroup XMC_Wait_Signal
  * @{
  */

#define XMC_WaitSignal_Disable              ((uint32_t)0x00000000)
#define XMC_WaitSignal_Enable               ((uint32_t)0x00002000)
#define IS_XMC_WAIT_SIGNAL(SIGNAL)          (((SIGNAL) == XMC_WaitSignal_Disable) || \
                                             ((SIGNAL) == XMC_WaitSignal_Enable))
/**
  * @}
  */

/** @defgroup XMC_Extended_Mode
  * @{
  */

#define XMC_WriteTiming_Disable             ((uint32_t)0x00000000)
#define XMC_WriteTiming_Enable              ((uint32_t)0x00004000)

#define IS_XMC_WRITE_TIMING(STATE)          (((STATE) == XMC_WriteTiming_Disable) || \
                                             ((STATE) == XMC_WriteTiming_Enable))

/**
  * @}
  */

/** @defgroup XMC_Write_Burst
  * @{
  */

#define XMC_WriteBurstSyn_Disable           ((uint32_t)0x00000000)
#define XMC_WriteBurstSyn_Enable            ((uint32_t)0x00080000)
#define IS_XMC_WRITE_BURST_SYN(SYN)         (((SYN) == XMC_WriteBurstSyn_Disable) || \
                                             ((SYN) == XMC_WriteBurstSyn_Enable))
/**
  * @}
  */

