RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_xmc.h
/** @defgroup XMC_Address_Setup_Time
  * @{
  */

#define IS_XMC_ADDRESS_OP_TIME(TIME)        ((TIME) <= 0xF)

/**
  * @}
  */

/** @defgroup XMC_Address_Hold_Time
  * @{
  */

#define IS_XMC_ADDRESS_HOLD_TIME(TIME)      ((TIME) <= 0xF)

/**
  * @}
  */

/** @defgroup XMC_Data_Setup_Time
  * @{
  */

#define IS_XMC_DATA_OP_TIME(TIME)           (((TIME) > 0) && ((TIME) <= 0xFF))

/**
  * @}
  */

/** @defgroup XMC_Bus_Turn_around_Duration
  * @{
  */

#define IS_XMC_INTERVAL_BETWEEN_OP_TIME(TIME)       ((TIME) <= 0xF)

/**
  * @}
  */

/** @defgroup XMC_CLK_Division
  * @{
  */

#define IS_XMC_CLK_DIV(DIV)                 ((DIV) <= 0xF)

/**
  * @}
  */

/** @defgroup XMC_Data_Latency
  * @{
  */

#define IS_XMC_DATA_STABLE_TIME(TIME)       ((TIME) <= 0xF)

/**
  * @}
  */

/** @defgroup XMC_Access_Mode
  * @{
  */

#define XMC_Mode_A                          ((uint32_t)0x00000000)
#define XMC_Mode_B                          ((uint32_t)0x10000000)
#define XMC_Mode_C                          ((uint32_t)0x20000000)
#define XMC_Mode_D                          ((uint32_t)0x30000000)
#define IS_XMC_MODE(MODE)                   (((MODE) == XMC_Mode_A) || \
                                             ((MODE) == XMC_Mode_B) || \
                                             ((MODE) == XMC_Mode_C) || \
                                             ((MODE) == XMC_Mode_D))

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup NAND_PCCARD_Controller
  * @{
  */

/** @defgroup XMC_Wait_feature
  * @{
  */

#define XMC_WaitOperation_Disable           ((uint32_t)0x00000000)
#define XMC_WaitOperation_Enable            ((uint32_t)0x00000002)
#define IS_XMC_WAIT_OPERATION(OPERATION)    (((OPERATION) == XMC_WaitOperation_Disable) || \
                                             ((OPERATION) == XMC_WaitOperation_Enable))

/**
  * @}
  */


/** @defgroup XMC_EnableECC
  * @{
  */

#define XMC_ECCOperation_Disable            ((uint32_t)0x00000000)
#define XMC_ECCOperation_Enable             ((uint32_t)0x00000040)
#define IS_XMC_ECC_OPERATION(OPERATION)     (((OPERATION) == XMC_ECCOperation_Disable) || \
                                             ((OPERATION) == XMC_ECCOperation_Enable))

/**
  * @}
  */

/** @defgroup XMC_ECC_Page_Size
  * @{
  */

#define XMC_ECCPageSize_256Bytes            ((uint32_t)0x00000000)
#define XMC_ECCPageSize_512Bytes            ((uint32_t)0x00020000)
#define XMC_ECCPageSize_1024Bytes           ((uint32_t)0x00040000)
#define XMC_ECCPageSize_2048Bytes           ((uint32_t)0x00060000)
#define XMC_ECCPageSize_4096Bytes           ((uint32_t)0x00080000)
#define XMC_ECCPageSize_8192Bytes           ((uint32_t)0x000A0000)
#define IS_XMC_ECCPAGE_SIZE(SIZE)           (((SIZE) == XMC_ECCPageSize_256Bytes) || \
                                             ((SIZE) == XMC_ECCPageSize_512Bytes) || \
                                             ((SIZE) == XMC_ECCPageSize_1024Bytes) || \
                                             ((SIZE) == XMC_ECCPageSize_2048Bytes) || \
                                             ((SIZE) == XMC_ECCPageSize_4096Bytes) || \
                                             ((SIZE) == XMC_ECCPageSize_8192Bytes))

/**
  * @}
  */

/** @defgroup XMC_TCLR_Setup_Time
  * @{
  */

#define IS_XMC_DELAY_CR_TIME(TIME)          ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_TAR_Setup_Time
  * @{
  */

#define IS_XMC_DELAY_AR_TIME(TIME)          ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_Setup_Time
  * @{
  */

#define IS_XMC_SETUP_TIME(TIME)             ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_Wait_Setup_Time
  * @{
  */

#define IS_XMC_OP_TIME(TIME)                ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_Hold_Setup_Time
  * @{
  */

#define IS_XMC_HOLD_TIME(TIME)              ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_HiZ_Setup_Time
  * @{
  */

#define IS_XMC_WRITE_SETUP_TIME(TIME)       ((TIME) <= 0xFF)

/**
  * @}
  */

/** @defgroup XMC_Interrupt_sources
  * @{
  */

#define XMC_INT_RisingEdge                  ((uint32_t)0x00000008)
#define XMC_INT_Level                       ((uint32_t)0x00000010)
#define XMC_INT_FallingEdge                 ((uint32_t)0x00000020)
#define IS_XMC_INT(INT)                     ((((INT) & (uint32_t)0xFFFFFFC7) == 0x00000000) && ((INT) != 0x00000000))
#define IS_XMC_GET_INT(INT)                 (((INT) == XMC_INT_RisingEdge) || \
                                             ((INT) == XMC_INT_Level) || \
                                             ((INT) == XMC_INT_FallingEdge))
/**
  * @}
  */

/** @defgroup XMC_Flags
  * @{
  */

#define XMC_FLAG_RisingEdge                 ((uint32_t)0x00000001)
#define XMC_FLAG_Level                      ((uint32_t)0x00000002)
#define XMC_FLAG_FallingEdge                ((uint32_t)0x00000004)
#define XMC_FLAG_FEMPT                      ((uint32_t)0x00000040)
#define IS_XMC_GET_FLAG(FLAG)               (((FLAG) == XMC_FLAG_RisingEdge) || \
                                             ((FLAG) == XMC_FLAG_Level) || \
                                             ((FLAG) == XMC_FLAG_FallingEdge) || \
                                             ((FLAG) == XMC_FLAG_FEMPT))

#define IS_XMC_CLEAR_FLAG(FLAG)             ((((FLAG) & (uint32_t)0xFFFFFFF8) == 0x00000000) && ((FLAG) != 0x00000000))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup XMC_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup XMC_Exported_Functions
  * @{
  */

void XMC_ExtTimingConfig(uint32_t XMC_SubBank, uint8_t W2W_Timing, uint8_t R2R_Timing);
void XMC_NORSRAMReset(uint32_t XMC_Bank);
void XMC_NANDReset(uint32_t XMC_Bank);
void XMC_PCCARDReset(void);
void XMC_NORSRAMInit(XMC_NORSRAMInitType* XMC_NORSRAMInitStruct);
void XMC_NANDInit(XMC_NANDInitType* XMC_NANDInitStruct);
void XMC_PCCARDInit(XMC_PCCARDInitType* XMC_PCCARDInitStruct);
void XMC_NORSRAMStructInit(XMC_NORSRAMInitType* XMC_NORSRAMInitStruct);
void XMC_NANDStructInit(XMC_NANDInitType* XMC_NANDInitStruct);
void XMC_PCCARDStructInit(XMC_PCCARDInitType* XMC_PCCARDInitStruct);
void XMC_NORSRAMCmd(uint32_t XMC_Bank, FunctionalState NewState);
void XMC_NANDCmd(uint32_t XMC_Bank, FunctionalState NewState);
void XMC_PCCARDCmd(FunctionalState NewState);
void XMC_NANDECCCmd(uint32_t XMC_Bank, FunctionalState NewState);
uint32_t XMC_GetECC(uint32_t XMC_Bank);
void XMC_INTConfig(uint32_t XMC_Bank, uint32_t XMC_INT, FunctionalState NewState);
FlagStatus XMC_GetFlagStatus(uint32_t XMC_Bank, uint32_t XMC_FLAG);
void XMC_ClearFlag(uint32_t XMC_Bank, uint32_t XMC_FLAG);
ITStatus XMC_GetINTStatus(uint32_t XMC_Bank, uint32_t XMC_INT);
void XMC_ClearINTPendingBit(uint32_t XMC_Bank, uint32_t XMC_INT);

#ifdef __cplusplus
}
#endif

#endif /*__AT32F4xx_XMC_H */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


